Tekla.Structures.Internal.Magic
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.Magic.#ctor
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.Magic.CreateCorrectInstanceFromAssembly(System.String,System.String)
Creates instance of given type from given assembly,
and creates instances of constructor parameters and stores them to this class
AssemblyName:
TypeName:
Returns: instance of given type

Tekla.Structures.Internal.Magic.WriteParametersToCurrentDataStorageInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.Magic.ReadParametersFromCurrentDataStorageInstance
DO NOT USE! For internal usage only!